Revit 2024 API
RailIndex Enumeration
 The continuous rail position index.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum RailIndex
Visual Basic
Public Enumeration RailIndex
Visual C++
public enum class RailIndex
Members
Member name | Description
Top |  The rail is located on the top of the railing.
LeftPrimary |  The rail is a primary rail on the left.
RightPrimary |  The rail is a primary rail on the right.
LeftSecondary |  The rail is a secondary rail on the left.
RightSecondary |  The rail is a secondary rail on the right.
See Also
Autodesk.Revit.DB.Architecture Namespace